import matplotlib.pyplot as plt

def get_graph():
    fig = plt.figure(figsize=(40, 40))
    plt.title("Рандомный вектор")
    fig.add_subplot(1, 3, 1)
    plt.scatter(
        [245591, 997858, 2273335, 4081581, 6310790, 9048252, 12332917, 16099177, 20384159, 25156706, 157016168, 626390621, 2507195226],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для insertionSort",
    )
    plt.scatter(
        [246590, 999857, 2276334, 4085580, 6315789, 9054251, 12339916, 16107176,  20393158, 25166705, 157041167, 626440620, 2507295225],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для insertionSort",
    )
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    fig.add_subplot(1, 3, 2)
    plt.scatter(
    [6690, 17572, 26970, 35570, 47774, 58744, 70899, 89484, 97485, 109402, 272307, 594433, 1232776],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для quickSort",
    )
    plt.scatter(
        [7866, 17001, 26628, 37041, 46854, 57903, 68379, 79395,  89274, 101487, 282102, 606543, 1312515],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для quickSort",
    )
    plt.legend(loc=1, prop={"size": 5})
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    fig.add_subplot(1, 3, 3)
    plt.scatter(
    [19449, 44846, 73236, 101638, 132021, 158417, 191798, 227193,  255601, 293976, 809841, 1769601, 3839091],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для combsort",
    )
    plt.scatter(
        [13011, 28884, 47559, 65346, 84177, 103638, 124149, 141822, 165057, 180798, 503694, 1074228, 2212425],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для combsort",
    )
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    plt.show()

if __name__ == '__main__':
    get_graph()