import matplotlib.pyplot as plt

def get_graph():
    fig = plt.figure(figsize=(40, 40))
    plt.title("Обратноосортированный вектор")
    fig.add_subplot(1, 3, 1)
    plt.scatter(
        [504499, 2000999, 4501499, 8001999, 12502499, 18002999, 24503499, 32003999, 32011998, 40504499, 50004999, 312512499, 1250024999, 5000049999],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для insertionSort",
    )
    plt.scatter(
        [501498, 2002998, 4504498, 8005998, 12507498, 18008998, 24510498, 32011998, 40513498, 50014998, 312537498, 1250074998, 5000149998],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для insertionSort",
    )
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    fig.add_subplot(1, 3, 2)
    plt.scatter(
    [6996, 15974, 25928, 35928, 46834, 57834, 68834, 79834, 91644, 103644, 292262, 634496, 1368962],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для quickSort",
    )
    plt.scatter(
        [3030, 6066, 10428, 12138, 16356, 20856, 22782, 24282, 28212, 32712, 86646, 173298, 346602],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для quickSort",
    )
    plt.legend(loc=1, prop={"size": 5})
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    fig.add_subplot(1, 3, 3)
    plt.scatter(
    [19449, 44846, 73236, 101638, 132021, 158417, 191798, 227193, 255601, 293976, 809841, 1769601, 3839091],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для combsort",
    )
    plt.scatter(
        [4980, 10362, 16434, 22350, 28398, 35208, 41256, 47520, 53982, 59826, 167664, 351384, 744234],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для combsort",
    )
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    plt.show()

if __name__ == '__main__':
    get_graph()