import matplotlib.pyplot as plt

def get_graph():
    fig = plt.figure(figsize=(40, 40))
    plt.title("Отсортированный вектор")
    fig.add_subplot(3, 1, 1)
    plt.scatter(
        [999, 1998, 2999, 3999, 4999, 5999, 6999, 7999, 8999, 9999, 24999, 49999, 99999],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для insertionSort",
    )
    plt.scatter(
        [1998, 3998, 5998, 7998, 9998, 11998, 13998, 15998, 17998, 19998, 49998, 99998, 199998],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для insertionSort",
    )
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    fig.add_subplot(3, 1, 2)
    plt.scatter(
        [7987, 17964, 28917, 39917, 51822, 63822, 75822, 87822, 100631, 113631, 317248, 684481, 1468946],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для quickSort",
    )
    plt.scatter(
        [1533, 3096, 5928, 6141, 8856, 11856, 12285, 12285, 14712, 17712, 49149, 98301, 196605],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для quickSort",
    )
    plt.legend(loc=1, prop={"size": 5})
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    fig.add_subplot(3, 1, 3)
    plt.scatter(
        [19499, 44846, 73236, 101638, 132021, 158417, 191798, 227193, 255601, 293976, 809841, 1769601, 3839091],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во сравнений для combsort",
    )
    plt.scatter(
        [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 25000, 50000, 100000],
        label="Кол-во копий для combsort",
    )
    plt.xlabel("длина массива")
    plt.ylabel("кол-во")

    plt.show()

if __name__ == '__main__':
    get_graph()